# IsApplicable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPipeFittingAndAccessoryPressureDropServer..::..IsApplicable Method
IPipeFittingAndAccessoryPressureDropServer Interface See Also
---
Check if the server is applicable for the pipe fitting or pipe accessory.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
bool IsApplicable(
	PipeFittingAndAccessoryPressureDropData data
)
```

Visual Basic
---
```text
Function IsApplicable ( _
	data As PipeFittingAndAccessoryPressureDropData _
) As Boolean
```

Visual C++
---
```text
bool IsApplicable(
	PipeFittingAndAccessoryPressureDropData^ data
)
```

# ### Parameters
data
    Type: Autodesk.Revit.DB.Plumbing..::..PipeFittingAndAccessoryPressureDropData The input data of the calculation.
# See Also
IPipeFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace